# Working with GroupBy

Hi Guys, Welcome to [Tirendaz Academy](https://youtube.com/c/tirendazacademy) üòÄ
</br>
In this notebook, I'm going to show how to work with the groupby method in Pandas.
</br>
Happy Learning üê±‚Äçüèç

In [1]:
import pandas as pd
import numpy as np

In [3]:
df=pd.DataFrame({"key":list("ABC")*2,
                 "data1":range(6),
                 "data2":np.arange(5,11)})

In [ ]:
df

  key  data1  data2
0   A      0      5
1   B      1      6
2   C      2      7
3   A      3      8
4   B      4      9
5   C      5     10

In [4]:
group=df.groupby("key")
print (group)

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x702e94b1e5d0>

In [ ]:
group.aggregate(["min",np.median,"max"])

    data1            data2
      min median max   min median max
key
A       0    1.5   3     5    6.5   8
B       1    2.5   4     6    7.5   9
C       2    3.5   5     7    8.5  10

In [ ]:
group.agg({"data1":"min","data2":"max"})

     data1  data2
key
A        0      8
B        1      9
C        2     10

In [ ]:
def f(x):
    return x.max()-x.min()

In [ ]:
group.agg(f)

     data1  data2
key
A        3      3
B        3      3
C        3      3

## Applying more than one function

In [ ]:
data=pd.DataFrame({"letter":list("ABC")*4,
                   "num":["one","two"]*6,
                   "d1":np.random.randn(12),
                   "d2":np.arange(10,33,2)})

In [ ]:
data

   letter  num        d1  d2
0       A  one  0.988512  10
1       B  two  1.318566  12
2       C  one  0.606850  14
3       A  two -1.029892  16
4       B  one  0.232158  18
5       C  two  0.380758  20
6       A  one -1.202409  22
7       B  two  0.209867  24
8       C  one -1.164496  26
9       A  two  0.194654  28
10      B  one  0.160770  30
11      C  two -0.301062  32

In [ ]:
group=data.groupby(["letter","num"])

In [ ]:
group_d1=group["d1"]

In [ ]:
group_d1.agg("mean")

letter  num
A       one   -0.106948
        two   -0.417619
B       one    0.196464
        two    0.764216
C       one   -0.278823
        two    0.039848
Name: d1, dtype: float64

In [10]:
group_d1.agg(["mean","std",f])

NameError: name 'group_d1' is not defined

In [9]:
group_d1.agg([("f_mean","mean"),
              ("f_std",np.std)])

NameError: name 'group_d1' is not defined

In [8]:
group.agg({"d1":["count","max","mean"],
           "d2":"sum"})

KeyError: "Column(s) ['d1', 'd2'] do not exist"

In [7]:
data.groupby(["letter","num"],
             as_index=False).mean()

NameError: name 'data' is not defined

## Split-Apply-Combine

In [6]:
data

NameError: name 'data' is not defined

In [5]:
group=data.groupby("letter")

NameError: name 'data' is not defined

In [ ]:
group["d2"].apply(lambda x:x.describe())

letter
A       count     4.000000
        mean     19.000000
        std       7.745967
        min      10.000000
        25%      14.500000
        50%      19.000000
        75%      23.500000
        max      28.000000
B       count     4.000000
        mean     21.000000
        std       7.745967
        min      12.000000
        25%      16.500000
        50%      21.000000
        75%      25.500000
        max      30.000000
C       count     4.000000
        mean     23.000000
        std       7.745967
        min      14.000000
        25%      18.500000
        50%      23.000000
        75%      27.500000
        max      32.000000
Name: d2, dtype: float64

In [ ]:
math=pd.DataFrame({"Class":list("AB")*3,
                   "Stu":["Kim","Sam",
                          "Tim","Tom","John","Kate"],
                   "Score":[60,70,np.nan,
                            55,np.nan,80]})
math

  Class   Stu  Score
0     A   Kim   60.0
1     B   Sam   70.0
2     A   Tim    NaN
3     B   Tom   55.0
4     A  John    NaN
5     B  Kate   80.0

In [ ]:
group=math.groupby("Class")

In [ ]:
group.mean()

           Score
Class
A      60.000000
B      68.333333

In [ ]:
func=lambda f:f.fillna(f.mean())

In [ ]:
group.apply(func)

        Class   Stu  Score
Class
A     0     A   Kim   60.0
      2     A   Tim   60.0
      4     A  John   60.0
B     1     B   Sam   70.0
      3     B   Tom   55.0
      5     B  Kate   80.0

In [ ]:
value={"A":100,"B":50}

In [ ]:
func1=lambda f:f.fillna(value[f.name])

In [ ]:
group.apply(func1)

  Class   Stu  Score
0     A   Kim   60.0
1     B   Sam   70.0
2     A   Tim  100.0
3     B   Tom   55.0
4     A  John  100.0
5     B  Kate   80.0

Don't forget to follow us on [YouTube](http://youtube.com/tirendazacademy) | [Medium](http://tirendazacademy.medium.com) | [Twitter](http://twitter.com/tirendazacademy) | [GitHub](http://github.com/tirendazacademy) | [Linkedin](https://www.linkedin.com/in/tirendaz-academy) | [Kaggle](https://www.kaggle.com/tirendazacademy) üòé